# PANDAS

In [1]:
import numpy as np
import pandas as pd

## Series

**A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.**

**We can convert a list,numpy array, or dictionary to a Series**

In [2]:
labels=['a','b','c']
my_data=[10,20,30]
arr = np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
print(labels)
print(my_data)
print(arr)
print(d)

['a', 'b', 'c']
[10, 20, 30]
[10 20 30]
{'a': 10, 'b': 20, 'c': 30}

In [4]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy',"Japan"])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA']

1

In [12]:
ser2['Italy']

5

**Operations are possible on series and any operation on integer gives out an float value to have precise values**

**ser1+ser2 gives 2 null values
as USSR and Italy do not match....**

**Only on matched values the operations take place**

In [13]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# DATA FRAMES

**DataFrame as a bunch of Series objects put together to share the same index**

In [14]:
from numpy.random import randn

In [16]:
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [20]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [21]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [22]:
type(df['W'])

pandas.core.series.Series

In [23]:
type(df)

pandas.core.frame.DataFrame

**From the above codes its identifiable that a DataFrame is a bunch of Series that share the same index**

In [25]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [27]:
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

### Create new columns

In [28]:
df['new']=df['W']+df['Z']

In [29]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

## Drop a column 

To drop a column the axis must be specified 

df.shape is (5,4), which is a tuple... Hence the rows are axis(0) and Column are axis(1)

**axis=1 (for column)**

**axis=0 (for column)**

**inplace=True is an argumment thats needed or the code will not affect the dataframe**

This is because we don't want to lose any data in a large file while making changes

In [30]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [31]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [32]:
df.drop('new',axis=1,inplace=True)

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [35]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selecting rows in a dataframe

can be done with **df.loc[ ] or df.iloc[ ]**

In [38]:
df.loc['B']

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [39]:
df.iloc[1]

W   -0.134841
X    0.390528
Y    0.166905
Z    0.184502
Name: B, dtype: float64

In [41]:
df.loc['C','Y']

0.638787013499328

In [42]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [44]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [45]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True

In [46]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752

In [47]:
df[df<0]

          W        X         Y         Z
A       NaN      NaN -1.706086 -1.159119
B -0.134841      NaN       NaN       NaN
C       NaN      NaN       NaN       NaN
D -0.497104 -0.75407 -0.943406       NaN

In [48]:
df[df==0]

    W   X   Y   Z
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN

In [51]:
df.W>0

A     True
B    False
C     True
D    False
Name: W, dtype: bool

In [52]:
df[df.W>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [53]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

**we can stak code as its a dataframe command, we can select column X where in the dataframe the condition Z>0 is applied**

This can be done for single or multiple columns

In [57]:
df[df['Z']>0]['X']

B    0.390528
C    0.072960
D   -0.754070
Name: X, dtype: float64

In [58]:
df[df['X']>0][['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646

In [69]:
df[(df['W']>0) & (df['Y'])<1]

          W         X         Y         Z
B -0.134841  0.390528  0.166905  0.184502
D -0.497104 -0.754070 -0.943406  0.484752

In [70]:
df[(df['W']>0) & (df['Y'])<1][['X','Y']]

          X         Y
B  0.390528  0.166905
D -0.754070 -0.943406

In [79]:
df[(df['W']<1) | (df['Y'])>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

## Renaming Index in a DataFrame

In [80]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [81]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752

In [82]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [88]:
newind='CA NY WY OR'.split()

In [89]:
newind

['CA', 'NY', 'WY', 'OR']

In [104]:
df.reset_index(inplace=True)

In [106]:
df.drop('States',axis=1,inplace=True)

In [107]:
df

          W         X         Y         Z
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752

In [108]:
df['States']= newind

In [110]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752

## Multiple Index and Index Hierarchy

In [112]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

## Missing Data

In [113]:
dat = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [114]:
dat

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [117]:
dt=pd.DataFrame(dat)
dt

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

**To drop a nan value we can use dropna()** - this drops the rows with nan values

**to drop a column we must include axis=1 as for a row it is axis=0 which is default**

In [119]:
dt.dropna()

     A    B  C
0  1.0  5.0  1

In [120]:
dt

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [121]:
dt.dropna(axis=1)

   C
0  1
1  2
2  3

In [122]:
dt.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [123]:
dt.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

**Above we set thresh=2, so the threshold for is 2 and row 1 has two non-nan values and hence that's also included without being removed**

##### Replacing missing values

In [124]:
dt

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [125]:
dt.fillna(value='Fill Value')

            A           B  C
0         1.0         5.0  1
1         2.0  Fill Value  2
2  Fill Value  Fill Value  3

In [126]:
dt['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [127]:
dt[['A','B']]

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  NaN

In [130]:
dt.fillna(value=dt['A'].mean())['A']

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

**Above we have filled the NaN values with the mean value of the column A**

### Groupby

In [131]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [132]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [134]:
dtd = pd.DataFrame(data)
dtd

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [140]:
dtd.groupby('Company')

#### This says that the dataframe is grouped by Company at the memory location given

Now we can perform min(), max(), std(), mean(), describe() or any aggregate function on to the grouped data

In [142]:
dtd.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [143]:
dtd.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [144]:
dtd.groupby('Company').std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [145]:
dtd.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

**The describe() fuction gives the detailed min,max,mean,std and percentage in a single frame**

In [153]:
dtd.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [154]:
dtd.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [155]:
dtd.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [160]:
dtd.groupby('Company').describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

## Merging Joining and Concatenating